Repository: eugeneai/bash-essentials-ru-handbok
Catalog: tmx/en-ru-level2.tmx
Source language: en
Languages: ru

source: If you type this IP address into a lookup site like https://whatismyipaddress.com/ip, you will find the following “DNS” information about it.
ru: Если набрать этот IP-адрес в поисковый сайт, например https://whatismyipaddress.com/ip, можно получить следующий ответ сервера DNS.

source: If you understand what each of these characters do, you understand how to use regular expressions.
ru: Понимание функций каждого из этих символов - ключ к возможности использования регулярных выражений.

source: If you use this command with a larger company like Google, you will get more verbose results due to the fact that they operate many servers and many mail servers.
ru: Если использовать команду с серверами Google, можно получить больше записей, так как в их сети размещено много серверов, в том числе, поддерживающих электронную почту.

source: If you use your new skills, you can find more information about the exec command by piping the find man pages into less and searching for the word “exec”.
ru: Пользуясь новыми навыками, вы можете посмотреть дополнительную информацию о exec, перенаправив вывод-страницу man в less и выполнив поиск по слову «exec».

source: If you want to add it at the end, you can change the line to this:
ru: Если вы хотите добавить новый директорий его в конец списка, то это делается следующим образом:

source: If you want to create a global variable, you will need to export it in one of your bash configuration files.
ru: Чтобы сделать переменную глобальной, ее помещают в один из файлов конфигурации bash.

source: If you want to display multiple windows in top (usually I do not need this feature), you can enter alternate display mode by typing A.
ru: Если вы хотите отобразить несколько окон, что top тоже позволяет, можно активировать альтернативный режим отображения, вводя A.

source: If you want to protect the user input (ex: password entry), just add an -s at the beginning of the command like so:
ru: Если надо защитить (скрыть) ввод пользователя (например, для ввода пароля), добавляется -s в начале команды:

source: If you want to stop that process, you can always hit the CTRL-C command.
ru: Если надо остановить процесс используйте комбинацию клавиш CTRL-C.

source: If you want, you can read the man pages for the ps command to learn the equivalent commands that we talk about (hint: ps ax will print out all your current processes).
ru: Можно изучить страницы руководства man для команды ps, где перечисляются эквивалентные команды тем, о которых далее идет речь, например, ps ax распечатывает все ваши текущие процессы.

source: If your output does not print in color, you can add the --color flag to your command.
ru: Если результат выдатся в монохромном режиме, можно его раскрасить, добавив флаг цвета.

source: If your regular expression is a really long one, it is often helpful to group off different sections of it.
ru: Если регулярное выражение сильно длинное, бывает полезно сгруппировать различные его части.

source: If you’re low on disk space, this command will be your good friend and help you find those files that are taking up unecessary space on your computer.
ru: Если у вас мало места на дисках, эта команда поможет найти те файлы, которые занимает недоступное пространство на вашем компьютере.

source: If you’re wondering how this is any different from my original search, that’s good because there is no difference other than the -P flag which tells grep to interpret this as a regular expression.
ru: Интересно, чем данный пример отличается от предыдущего вариянта поиска. Пока что нет никакой разницы, кроме использвания флага -P, переключающего grep в режим интерпретации аргуманта как регулярного выражения.

source: Immediately we can see that this server is run by OpenDNS LLC, which makes sense because this is a well known DNS server.
ru: Сразу видно, что этим сервером управляет OpenDNS LLC, это всем известный DNS-сервер.

source: Implement a multicriterial assessment of scenarios.
ru: Реализация многокритериальной оценки сценариев.

source: Implementation concepts
ru: Концепции реализации

source: Implementation of the visualization routines.
ru: Реализация подпрограмм визуализации результатов.

source: Implementation of transformation rules from SysML diagrams to PCFs and other internal objects in the Logtalk programming language.
ru: Реализация процедур трансформации диаграмм SysML в ПОФ и другие внутренние объекты в языке программирования Logtalk.

source: Implementing default strategy modifiers to support reasoning over grammars of resource-based game or an equivalent rule-based representation.
ru: Реализация модификаторов стратегии по умолчанию для поддержки в процедуре логического вывода некоторого эквивалента грамматик ресурсно-управляемых игр.

source: Implementing multiset and its relations in automatic theorem proving software.
ru: Реализация мультимножеств и их отношений в программном обеспечении автоматического доказательства теорем.

source: Improvement of the middle level of simulation process (domain part).
ru: Усовершенствование представления модели среднего уровня в имитационном моделировании (предметная задача).

source: In 99% of the cases, these commands can be run interchangeably for the same type of data.
ru: В 99% случаев эти команды взаимозаменяемы.

source: In ISDCT SB RAS a number of techniques of its implementation is being developed.
ru: В ИДСТУ СО РАН разрабатываются ряд методов его реализации.

source: In Public Republic of China there are many schools of automation and institutes of Chinese Academy of Sciences.
ru: В КНР существует множество школ автоматизации при университетах, а также институты Китайской академии наук.

source: In RSF Project 16-11-00053 a logical programming like language grammar for PCFs was developed to describe team missions of robots [5].
ru: В проекте РНФ 16-11-00053 разработана грамматика для логического программирования, основанного на ПОФ, для описания миссий роботов [5].

source: In [10] a data-driven user interface and visualization is considered in the process of a clinical decision support system implementation.
ru: В [10] рассматривается разработка пользовательского интерфейса для визуализации, управляемый данными; интерфейс используется в системе поддержки принятия клинических решений.

source: In [22] and [23] we proposed and partially realized a technique for dataflow representation of all Mothur commands.
ru: В [22] и [23] мы предложили и частично реализовали методику представления потока данных всех команд Mothur.

source: In [3] the problem of cloud usage for storage and computing is stated as the basic problem of NGS, as storage capacity exponential growth is slower as compared to the growth of the NGS generated data volume.
ru: В [3] проблема использования облачных хранилищ и вычислений сформулирована как основная проблема NGS, так как экспоненциальный рост емкости хранилища происходит медленнее по сравнению с ростом объема данных, генерируемых NGS.

source: In [7] Go, C++ and Java programming languages were assessed with respect to the ease of implementation, memory consumption and overall computation performance, Go was chosen.
ru: В [7] языки программирования Go, C ++ и Java оценены с точки зрения простоты реализации, потребления памяти и общей производительности вычислений; в результате выбран Go.

source: In [8] a NGS analysis pipeline was developed for analysis viruses’ DNA contained in human body.
ru: В [8] разработан конвейер NGS для анализа ДНК вирусов в организме человека.

source: In a general case the admissible state is defined as a set of constraints.
ru: В общем случае допустимое состояние определяется набором ограничений.

source: In addition to the above review of the research, we must note that due to great interest of the research object there are many research groups in world devoted to the industrial automation and control.
ru: В дополнение к вышепредставленному обзору исследований, следует отметить, что в связи с большим интересом к объекту исследования существует множество исследовательских групп в мире, ведущих исследования промышленной автоматизации и управления, особенно в КНР.

source: In both expressions, we replaced \.com with (.com|.net){1} to match either “.com” or “.net” email addresses exactly once.
ru: В обоих выражениях заменена строка \.com на (.com|.net){1}, чтобы искать или “.com” или “.net” в email в точности один раз.

source: In comparison to the known algorithms, the proposed one implements an adaptive multi-scenario solving this issue and therefore increases a degree of computational process fault-tolerance.
ru: В отличие от известных, предложенные алгоритмы реализуют адаптивные мульти-сценарные решения, что позволяет уваличить степень отказоустойчивости вычислительного процесса.

source: In comparison with Prolog and its constructive notation, PCFs have intuitionistic semantics in a wider range of rule representation, non-Horn ones.
ru: В сравнении с Prolog-ом и его конструктивным выводом, ПОФ поддерживают интуиционистскую семантику в более широком классе представления логических правил (в виде не-хорновских формул).

source: In comparison with modern GT models, MAS do not demand explicit representation of action of the opposing sides during conflict.
ru: В сравнении с современными моделями ТИ, МАС не требуют явного представления действий противоборствующих сторон в ходе конфликта.

source: In each workbook, there was data that I needed to copy and paste into my main workbook, but in the code, I had no way of determining what the name of this new workbook was.
ru: В каждой книге находятся данные, которые нужно скопировать в основную книгу, однако не было возможности определить имя этой новой книги.

source: In general, for a relatively long time in the competition is leading the "Vampire" system - the development of Soviet scientists from the IIS SB RAS - A. Voronkov and A. Ryazanov.
ru: Довольно долгое время в конкурсе лидирует программа "Вампир", разработка советских ученых из ИСИ СО РАН А. Воронкова и А. Рязанова.

source: In line 1, the area code is the same as the middle three numbers.
ru: В строке 1 код города такой же, как и следующие за ним три числа.

source: In my case, I am running the google-chrome command (will launch a Google Chrome Window) as a sample process that we can work with, and its process ID is 21124 as shown in the ps a output below.
ru: В данном случае используем google-chrome с нашим окном браузера, в качестве примера процесса. Идентификатор процесса - 21124, полученный в результате выполнения команды ps a.

source: In my case, I type the command:
ru: Для этого надо набрать команду:

source: In order to do so, the unique sequences must be classified.
ru: Для этого необходимо классифицировать уникальные последовательности.

source: In order to do so, we realized dataflow model of the technique (MiSeq implemented by Mothur package), which is to be converted to the software modules of various visual environments and cloud services.
ru: Для этого надо реализовали модель потока данных методики (MiSeq, реализованную пакетом Mothur), которая преобразовывается в программные модули различных визуальных сред и облачных сервисов.

source: In order to implement the computer simulation on PCFs representation of RDDESU, data structures for multisets and a default strategy modification are to be designed.
ru: Для осуществления имитационного моделирования на ПОФ-представлении РУДССН, необходимо разработать структуры данных для мультимножеств и модификацию стратегии по умолчанию.

source: In order to proceed with computer simulation and other object synthesis, the model of RDDESU must be represented as internal objects.
ru: Для того, чтобы проводить имитационное моделирование и синтез других объектов, модель РУДССН должна быть представлена в виде структур данных программы.

source: In other words, an IP address is made of two parts–the network identifier and the host “address space” identifier.
ru: Другими словами, IP-адрес состоит из двух частей - идентификатора сети и идентификатора «адресного пространства» сети.

source: In other words, my router knows where to direct my request because it has access to a domain name server somewhere.
ru: Другими словами, маршрутизатор знает, куда направить запрос, потому что у него есть доступ к серверу доменных имен.

source: In other words, we are omitting the first line.
ru: Другими словами, мы пропускаем первую строку.

source: In our case PSM represents Java source code of the dataflow modules.
ru: В нашем случае PSM представляет собой исходный код модулей потока данных на Java.

source: In our case we removed 11052 (25%) shorter readings.
ru: В нашем случае мы удалили 11052 (25%) коротких прочтений.

source: In our case, the website we are searching for is located in New York somewhere, but our browser does not yet know this!
ru: В нашем случае сайт, который мы ищем, находится где-то в Нью-Йорке, но наш браузер еще этого не знает!

source: In our case, we removed 1828 sequences, and the final set of sequences contains 9291 unique readings.
ru: В нашем случае удалено 1828 последовательностей, а окончательный набор содержит 9291 уникальное прочтение.

source: In our case, we want to send the SIGTSTP signal to our running process to throw it in the background and stop it.
ru: В нашем примере отправим сигнал SIGTSTP запущенному процессу, чтобы он перешел в фоновый режим и остановился.

source: In our project we will use visual notations and their tools, with conversion of the models into internal representation.
ru: В нашем проекте мы будем использовать визуальные модели и их инструменты, экземпляры моделей будут преобразовываться во внутреннее представление программ.

source: In regular expressions, the following characters will behave a bit oddly: .
ru: В регулярных выражениях поведение следующих символов отличается от символов, рассмотренных ранее: .

source: In some cases, it may be useful if we had a way of matching text at the beginning or end of a line.
ru: Часто бывает полезно обозначать начало и конец строки в шаблонах выражений.

source: In static mode, we set configuration of the top program on the command line.
ru: В статическом режиме конфигурация программы top устанавливается в командной строке.

source: In that case, you are going to need to use grep.
ru: В этом случае grep просто незаменим.

source: In the 2000s, a new direction of application of game theories (GT) with usage of classical control methods appears, namely, Mean field games models (a recent review is Gomes, D.A., Saúde, J. Mean Field Games Models—A Brief Survey.
ru: В 2000-х годах возниклов новое направление применения теории игр (ТИ), позволяющее использовать классические методы управления, а именно, игры среднего поля (свежий обзор: Gomes, D.A., Saúde, J. Mean Field Games Models—A Brief Survey.

source: In the IT field standard ways of the representation are UML, SysML, BPMN and other notations.
ru: В области информационных технологий (ИТ) языки UML, SysML, BPMN и др. являются стандартными методами представления визуальных моделей.

source: In the case of manufacturing modelling the sublanguage denote a set of events, which appearance can be controlled.
ru: В моделировании производства подъязык обозначает набор событий, возникновением которых можно управлять.

source: In the case the GT was used to describe possibilities to assign a job to equipment within a time interval, no competing actions were accounted.
ru: --- В исследовании не учитываются действия конкурентов при использовании ТИ для описания возможных назначений задач на оборудование для заданного интервала времени.

source: In the case when the input RDDESU specification is not controllable, controllable sublanguage (subautomaton) of this specification is to be found as a new admissible specification.
ru: В случае, когда спецификация входной РУДССН не является контролируемый, можно попытаться найти управляемый подъязык (subautomaton) как новую допустимую спецификацию.

source: In the cloud DaaS, we are to store files and its contents as object with its metadata.
ru: В облачном DaaS предполагается хранить файлы и их содержимое как объект с его метаданными.

source: In the command above, I have indicated to the traceroute utility that I want to resolve IP addresses into their hostnames with the --resolve-hostnames command, I want to send only one packet per host -q 1, I want to set the timeout for each request to 5 seconds with -w 5, and finally, I want to use ICMP protocol rather than UDP with the -I flag.
ru: В приведенной выше команде утилите traceroute указано, что необходимо преобразовать IP-адреса в их имена хостов (--resolve-hostnames), отправлять только один пакет на очередной маршрутизатор на пути следования пакета (-q 1), установить тайм-аут для каждого запроса в 5 секунд (-w 5) и, наконец, использовать протокол ICMP вместо UDP (-I).

source: In the end, the output is not important to you as a bash user, but is important in trying to understand how the computer starts and ends processes.
ru: В конце концов, вывод не важен пользователю bash, но важен для понимания процедуры запуска и заверения процессы.

source: In the environment, the activity influence of an agent to player is infinitely small and, hence, the influence of the opposites are aggregated accounted and even use iteratively techniques efficiently to figure out fixed point estimates.
ru: В такой МАС влияние результата деятельности агентов на основного игрока бесконечно мало, и, следовательно, влияние всей совокупности агентов учитывается аггрегативно, что даже позволяет эффективно использовать итерационные методы поиска неподвижной точки в оценке равновесия.

source: In the field of automated theorem proving, which is widely used on the upper levels of control systems, Russian researchers are the following (among the others).
ru: В области автоматического доказательства теорем, который широко используется на верхних уровнях системы управления, известые исследования проведены российскими учеными (среди прочих).

source: In the output that I have shown, you can see the execve command starts off the process.
ru: В приведенном тексте показано, сто команда execveзапускает процесс.

source: In the paper (Du X, Xi Y, Li S. Distributed model predictive control for large-scale systems.
ru: В статье (Du X, Xi Y, Li S. Distributed model predictive control for large-scale systems.

source: In the same time the practical requirements imposed us to develop means for complex DES representation, namely, data structures, visual DES representation, automatic (unattended) intelligent methods and software of control synthesis.
ru: В то же время требования практики вынудлают нас учитывать сложность объекта управления, и, соответственно, разрабатывать методы и средств для комплексного представления ДСС, а именно, структуры данных, визуальное представление ДСС, программное обеспечение для автоматического интеллектного синтеза управления.

source: In the same time, for each scenario executed on a CPU a priority could be assigned in the image and likeness of A* algorithm or AND-OR-trees, resulting in the more perspective scenarios calculating early.
ru: В то же время для каждого сценария, выполняющегося на процессоре, можно назначить приоритеты по образу и подобию алгоритма поиска A* или И-ИЛИ-деревьев, что позволит проводить более перспективные расчеты раньше.

source: In the settings, you will want the following:
ru: Далее требуется добавить следующие настройки:

source: In the simplest case, data and metadata can be stored in metadata storages, such as ClioPatria.
ru: В простейшем случае данные и метаданные можно хранить в хранилищах метаданных, таких как ClioPatria.

source: In the system with structural uncertainty and parameter uncertainty, Li et al.
ru: В системах со структурной неопределенностью и неопределенностью параметров Li et al.

source: In these man pages, you can see that the '{}' is where the files that were found are placed in the command and \; is a character that tells the exec script to stop executing.
ru: На этих страницах руководства видно, что '{}' указывает место, куда подставлять найденные файлы, и \; - это символ, указывающий грннацу команды для запуска exec.

source: In these papers the solution is designed as set of rules for reacting to the events.
ru: В этих статьях решение синтезируется как набор правил для обеспечения правильной реакции на события.

source: In this case data conversion needed.
ru: В этом случае требуется преобразование данных.

source: In this case, I will be checking a directory for files that have not been modified for 7 days or more and placing them in an archive folder named with today’s date.
ru: Будем проверять каталог на наличие файлов, которые не изменялись в течение семи или более дней, если это тка, то помещаем их в папку архива с текущей датой.

source: In this case, a set of actions are performed in the same time moment splitting the current scenario to a set of subscriptions (alternative virtual futures) for each possible action.
ru: Проблема решается порождением набора действий, выполняемых в один и тот же момент времени, разделяя сценарий на набор подсценариев (альтернативные варианты будущего) для каждого возможного действия.

source: In this case, researcher needs to match the OTUs from different studies.
ru: В этом случае исследователь должен сопоставить OTU из разных исследований.

source: In this case, we are going to need to modify the back half of the regular expression to the following.
ru: Нужно изменить правую половину регулярного выражения на следующий вариант.

source: In this case, we are telling it to run with the bash shell which is stored in /bin on our machine.
ru: В примере сообщается, что он скритп исполняется оболочкой bash, которая находится в директории /bin на компьютере.

source: In this direction, last decade we obtained results on decentralized hierarchical control synthesis for groups of autonomous underwater vehicles [4].
ru: В этом направлении за последнее десятилетие нами были получены результаты по децентрализованному иерархическому синтезу управления группой автономных подводных аппаратов [4].

source: In this example, I was searching my entire blog for the word “grep” and found it in 3 separate files.
ru: В этом примере, автор искал в своем блоге слово "grep" и нашел его в трех разных файлах.

source: In this project the two-level standardized model of manufacturing process will be enriched with resource-driven representation and parts simulating internal disturbances, giving rise of third level of execution dynamics.
ru: В этом проекте два уровня стандартной модели производственных процессов будуту дополнены моделями ресурсно-управляемых игр и частью, имитирующей возникновение внутренних возмущений, что создает третий уровень - уровень динамики выполнения плана производства.

source: In this response, you can see that I have one A record (the mapping between IP and domain name), three nameserver records, and one “Start of Authority” (SOA) record that indicates Digital Ocean is the authoritative source for the DNS record.
ru: В ответе видно, что домен содержит одну запись A (сопоставление IP-адреса и имени домена), три записи сервера имен и одна запись «Start of authority» (SOA), указывающая, что Digital Ocean является авторитетным источником для записи DNS.

source: In this script, we are looping through all of the user arguments provided to the script.
ru: В этом сценарии перебираются все переданные программе аргументы.

source: In this version, we are doing the same thing we did above with different syntax.
ru: В этой версии решается таже задача, но при помощи другого синтаксиса.
